In [41]:
print("**************************************************************")
print("                          DECISION TREE                       ")
print("**************************************************************")
from sklearn.datasets import load_digits
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt

**************************************************************
                          DECISION TREE
**************************************************************

In [99]:
df = pd.read_csv("Day9_DecisionTree.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [100]:
x = df.drop(df[['salary_more_then_100k']],axis="columns")
x.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [101]:
y = df.salary_more_then_100k

In [95]:
from sklearn.preprocessing import LabelEncoder

In [102]:
le_company = LabelEncoder()
le_job= LabelEncoder()
le_degree = LabelEncoder()

In [103]:
x['le_company'] = le_company.fit_transform(df['company'])
x['le_job'] = le_company.fit_transform(df['job'])
x['le_degree'] = le_company.fit_transform(df['degree'])
x.head()

In [104]:
x = x.drop(['company','job','degree'],axis='columns')
x.head()

   le_company  le_job  le_degree
0           2       2          0
1           2       2          1
2           2       0          0
3           2       0          1
4           2       1          0

In [105]:
from sklearn import tree

In [106]:
model = tree.DecisionTreeClassifier()
model.fit(x, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [110]:
model.score(x,y)

1.0

In [114]:
model.predict([[2,2,1]])

array([0])

In [115]:
model.predict([[2,0,1]])

array([1])

In [218]:
print("**************************************************************")
print("                            EXERCISE                          ")
print("**************************************************************")

**************************************************************
                            EXERCISE
**************************************************************

In [219]:
df = pd.read_csv("Day9_Exercise_SurvivalRate.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [221]:
x = df.drop(df[['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived']],axis="columns")
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [222]:
y = df.Survived
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [223]:
from sklearn.preprocessing import LabelEncoder

In [224]:
le_sex = LabelEncoder()

In [225]:
x['le_sex'] = le_company.fit_transform(df['Sex'])

In [226]:
x.head()

   Pclass     Sex   Age     Fare  le_sex
0       3    male  22.0   7.2500       1
1       1  female  38.0  71.2833       0
2       3  female  26.0   7.9250       0
3       1  female  35.0  53.1000       0
4       3    male  35.0   8.0500       1

In [227]:
x = x.drop(['Sex'],axis='columns')

In [228]:
float_col = x.select_dtypes(include = ['float64'])

In [229]:
for col in float_col.columns.values:
    x[col] = x[col].fillna(0).astype('int64')
x.head()

   Pclass  Age  Fare  le_sex
0       3   22     7       1
1       1   38    71       0
2       3   26     7       0
3       1   35    53       0
4       3   35     8       1

In [230]:
from sklearn import tree

In [231]:
model = tree.DecisionTreeClassifier()
model.fit(x, y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [232]:
model.score(x,y)

0.9494949494949495

In [233]:
model.predict([[1,38,71,0]])

array([1])